<?php
/**
 * Created by PhpStorm.
 * User: fuk
 * Date: 2015/1/23
 * Time: 14:20
 */

return array(
    'STATE_CERTIFICATE_VIDEO_STATUS_NUM' => array(
        '通过认证'=>1,
        '照片不清晰'=>2,
        '视频不清晰'=>2,
        '照片与视频不符'=>2,
        '未按要求完成认证' =>2,
        '照片不符合要求' =>2,
        '视频不符合要求' =>2,
    ),

    'STATE_CERTIFICATE_VIDEO_STATUS_TEXT' => array(
        '1' => '通过认证',
        '2' => '照片不清晰',
        '3' => '视频不清晰',
        '4' => '照片与视频不符',
        '6' => '未按要求完成认证',
        '7' => '照片不符合要求',
        '8' => '视频不符合要求',
    ),

    'STATE_CERTIFICATE_CAR_STATUS_NUM' => array(
        '通过认证'=>1,
        '车辆照不符和要求'=>2,
        '证件照不符和要求'=>2,
        '车辆照不清晰'=>2,
        '证件照不清晰'=>2,
        '车辆照与证件照不符'=>2,
        '驾驶证与行驶证不符'=>2,
        '车辆型号不符或无法识别'=>2,
        '未按要求完成认证'=>2,
    ),

    'STATE_CERTIFICATE_CAR_STATUS_TEXT' => array(
        '1' => '通过认证',
        '2' => '车辆照不符和要求',
        '3' => '证件照不符和要求',
        '4' => '车辆照不清晰',
        '5' => '证件照不清晰',
        '6' => '车辆照与证件照不符',
        '7' => '驾驶证与行驶证不符',
        '8' => '车辆型号不符或无法识别',
        '9' => '未按要求完成认证',
    ),

    'STATE_ACCUSATION_TYPE'=>array(
        '0'  => '违规类型出错',
        '1'  => '个人资料违规',
        '2'  => '聊天信息违规',
        '3'  => '动态内容违规',
    ),

    'STATE_ACCUSATION_PROCESS_REASONS' => array(
        '0' => '标签违规',
        '1' => '色情传播',
        '2' => '欺诈&广告',
        '3' => '招嫖卖淫',
        '4' => '违法&反动政治',
        '5' => '其他',
        '6' => '托',
        '7' => '骚扰',
    ),

    'STATE_ACCUSATION_PROCESS_STATES'  => array(
        '1' => '拒绝受理',
        '2' => '封禁1天' ,
        '3' => '封禁3天',
        '4' => '封禁5天',
        '5' => '永久封禁',
        '6' => '已处理不封禁',
    ),

    'STATE_CLOSURE_TIME'               => array(//拒绝受理不修改user表里的任何内容
        '1' => '-1 day',    //取消封禁
        '2' => '+1 day' ,   //封禁1天，在time()的基础上加1天
        '3' => '+3 day',    //封禁3天
        '4' => '+5 day',    //封禁5天
        '5' => '+3000 day', //永久封禁
    ),

    'STATE_FACE_RATE'                  => array(    
        '1' => '没有真人照',
        '2' => '丑',
        '3' => '一般',
        '4' => '好看',
    ),

    'STATE_CAR_RATE'                   => array(    
        '1' => '10万以下',
        '2' => '10-50万',
        '3' => '50万以上',
    ),

        
    // 男用户等级
    'USER_LEVEL_MAN'                   => array(
        '1'  => '小屌丝',
        '2'  => '一贫如洗',
        '3'  => '穷困潦倒',
        '4'  => '饥寒交迫',
        '5'  => '品貌非凡',
        '6'  => '清新俊逸',
        '7'  => '一表人才',
        '8'  => '才貌双全',
        '9'  => '风度翩翩',
        '10' => '玉树临风',
        '11' => '貌比潘安',
        '12' => '英俊潇洒',
        '13' => '白马王子',
    ),    

    // 女用户等级
    'USER_LEVEL_WMAN'                   => array(
        '1'  => '守身如玉',
        '2'  => '忠贞不渝',
        '3'  => '贤良淑德',
        '4'  => '知书达礼',
        '5'  => '秀外慧中',
        '6'  => '明艳动人',
        '7'  => '俏丽多姿',
        '8'  => '楚楚动人',
        '9'  => '千娇百媚',
        '10' => '貌若天仙',
        '11' => '沉鱼落雁',
        '12' => '闭月羞花',
        '13' => '倾国倾城',
    ),    

    // 小标签
    'SMALL_USER_IMG'                    =>array(
        '1'  => '积分乐园',
        '2'  => '充值',
        '3'  => '聚划算',
    ),

    // 标签审核状态
    'TAG_TYPE'                          =>array(
        '0'  => '未审核',
        '1'  => '审核失败',
        '2'  => '审核通过',
        '3'  => '删除',
        '4'  => '修改标签名称并通过',
    ),

    // 视频认证状态
    'VIDEO_RZSTATUS'                =>array(
        '-1' => '未提交视频认证照',
        '0'  => '等待视频审核',
        '1'  => '通过视频认证',
        '2'  => '视频认证失败',
    ),

    // 车认证状态
    'CAR_RZSTATUS'                =>array(
        '-1' => '未提交车辆认证照',
        '0'  => '等待车辆审核',
        '1'  => '通过车辆认证',
        '2'  => '车辆认证失败',
    ),

    // 用户性别
    'USER_SEX_IS'                =>array(
        '0'  => '男',
        '1'  => '女',
    ),








);
